#將給定的秒數轉成 時:分:秒,如:10000 秒, 則輸出 02:46:40
#注意:時 分 秒 各占 2 個字元,也就是說答案為 8 個字元
#Hint:輸出字串格式為 %02d:%02d:%02d
#輸入:第一行資料為測試資料之筆數,第二行之後為測試數值
#輸出:對每一組測試資料,輸出此測試資料之時:分:秒
#輸入範例: 輸出範例:
#2 
# 
#10000   02:46:40
#1       00:00:01 
def Zero2(n):
    if n <= 9:
        return f'0{n}'
    else:
        return f'{n}'

N =eval(input())
for i in range(N):
    TS = eval(input())
    S = TS % 60
    TM = TS // 60
    M = TM % 60
    H = TM// 60
    #print(f'{H:0>2}:{M:0>2}:{S:0>2}')
    print(f'{Zero2(H)}:{Zero2(M)}:{Zero2(S)}')